Написать программу. Пользователь вводит количество чисел, а затем сами целые числа. Вывести на экран те числа, которые меньше введённого предыдущего числа.

8) Написать программу. Пользователь вводит с клавиатуры символ типа wchar_t, и количество раз, которое его нужно вывести (целое неотрицательное число). Выведите этот символ столько строк подряд, какое количество ввёл пользователь, причём в первой строке символ выводится один раз, во второй два раза, в третьей 3 раза, а в последней введённое в начале количество раз.

9) Написать программу. Пользователь вводит количество чисел, а затем сами целые числа. Программа выводит на экран сообщение о том, являются ли введённые числа упорядоченными по-возрастанию,

10) Написать программу. Пользователь вводит количество чисел, а затем сами целые числа. Программа выводит на экран сообщение о том, являются ли введённые числа упорядоченными по-убыванию.

11) Написать программу. Пользователь вводит количество чисел, а затем сами целые числа. Если в последовательности чисел, которые ввёл пользователь есть только
